-------------------------------------------------------
-- 文件名 : encypt_copy_uid.lua
-- 说  明 : 加密公式,直接复制UID返回，仅演示测试用
-- 版  本 : V1.0  2020-09-06
-- Copyright (C), 2020-2030, 安富莱电子 www.armfly.com
-------------------------------------------------------

--UID加密函数，传入uid 和 rnd(随机数) 返回加密后的结果
--uid和_rnd格式为二进制字符串
--	&	按位与
--	|	按位或
--	~	按位异或
--	>>	右移
--	<<	左移
--	~	按位非
--	%   取模
--	^   乘方
--	-   取负

--A1 - A16 参数由PC软件配置后，将覆盖如下的初值
A1 = 1
A2 = 2
A3 = 3
A4 = 3
A5 = 4
A6 = 5
A7 = 6
A8 = 8
A9 = 9
A10 = 10
A11 = 11
A12 = 12
A13 = 13
A14 = 14
A15 = 15
A16 = 16

--调试加密函数的方法:
--print_hex(encrypt("\x12\x34\x56\x78\x90\x12", "1234"))

--原样返回uid， 
--_rnd : 算法函数第2个形参随机数，本例未使用
function encrypt(_uid, _rnd)
	return _uid
end

---------------------------结束-----------------------------------
