/*
*********************************************************************************************************
*
*	模块名称 : 设备参数模块
*	文件名称 : bsp_param.c
*	版    本 : V1.0
*	说    明 : 设备用的参数结构
*
*	修改记录 :
*		版本号  日期        作者     说明
*		V1.0    2010-09-20  armfly    正式发布
*
*	Copyright (C), 2010-2025, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/

#include "bsp.h"
#include "vcl.h"

CALIB_T g_tCalib;			/* 校准参数 */
INI_PARAM_T g_tIniParam;

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
