/*
*********************************************************************************************************
*
*	模块名称 : DSO示波器控制模块
*	文件名称 : bsp_dso_ctrl.c
*	版    本 : V1.0
*	说    明 : 示波器控制
*
*	修改记录 :
*		版本号  日期        作者     说明
*		V1.0    2019-02-15 armfly  正式发布
*
*	Copyright (C), 2019-2030, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/

#include "bsp.h"
#include "vcl.h"

/*
X1档：正负14V
X2档：正负7V
X4档：正负3.45V
X8档：正负1.75V
X16档：正负850mV
X32档：正负425mV
X64档：正负215mV
X128档：正负105mV
*/

DSO_T g_tDSO;
AI_T g_tAI;

/* 采样频率档位 */
int TabelFreq[FREQ_NUM] =
{
	100,
	200,
	500,
	1 * 1000,
	2 * 1000,
	5 * 1000,
	10 * 1000,
	20 * 1000,
	50 * 1000,
	100 * 1000,
	200 * 1000,
	500 * 1000,
	1 * 1000000,
	2 * 1000000,
	5 * 1000000,
	10 * 1000000,
	20 * 1000000,
};

/* 1us单位, 每大格时长 */
int TabelTimeDiv[TIME_DIV_NUM] =
{
	10 * 1000 * 1000,
	5 * 1000 * 1000,
	2 * 1000 * 1000,
	1 * 1000 * 1000,
	500 * 1000,
	200 * 1000,
	100 * 1000,
	50 * 1000,
	20 * 1000,
	10 * 1000,
	5 * 1000,
	2 * 1000,
	1 * 1000,
	500,
	200,
	100,
	50,
	20,
	10,
	5,
	2,
	1
};

int TabelVoltDiv[VOLT_DIV_NUM] =
{
	5000,
	2000,
	1000,
	500,
	200,
	100,
	50,
	20,
	10,
	5,
	2,
	1
};

/* 采样深度 */
int TabelBufSize[BUFF_SIZE_NUM] =
{
	1*1024,
	2*1024,
	4*1024,
	8*1024,
	16*1024,

	/* 下面无用 */
	32*1024,
	64*1024,
	128*1024,
	256*1024,
	512*1024,
};

/*
*********************************************************************************************************
*	函 数 名: TimeDivToStr
*	功能说明: 时间分度转换为显示字符串
*	形    参:  无
*	返 回 值: 无
*********************************************************************************************************
*/
AnsiString TimeDivToStr(int _div)
{
	AnsiString s;
	int div;

	div =  TabelTimeDiv[_div];

	if (div >= 1000 * 1000)
	{
		s.sprintf("%ds", div / 1000000);
	}
	else if (div >= 1000)
	{
		s.sprintf("%dms", div / 1000);
	}
	else
	{
		s.sprintf("%dus", div);
	}
	return s;
}

/*
*********************************************************************************************************
*	函 数 名: VoltDivToStr
*	功能说明: 电压分度转换为显示字符串
*	形    参:  无
*	返 回 值: 无
*********************************************************************************************************
*/
AnsiString VoltDivToStr(int _div)
{
	AnsiString s;
	int div;

	div =  TabelVoltDiv[_div];

	if (div >= 1000)
	{
		s.sprintf("%dV", div / 1000);
	}
	else
	{
		s.sprintf("%dmV", div);
	}
	return s;
}


/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
