/*
*********************************************************************************************************
*
*	模块名称 : DAC控制模块
*	文件名称 : bsp_dac_ctrl.c
*	版    本 : V1.0
*	说    明 : DAC控制
*
*	修改记录 :
*		版本号  日期        作者     说明
*		V1.0    2019-02-15 armfly  正式发布
*
*	Copyright (C), 2019-2030, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/

#include "bsp.h"
#include "vcl.h"
#include "udp_modbus_addr.h"
#include "bsp_udp_modbus.h"

/*
*********************************************************************************************************
*	函 数 名: dac1_SetWave
*	功能说明: 电压分度转换为显示字符串
*	形    参:  无
*	返 回 值: 无
*********************************************************************************************************
*/
void dac1_SetWave(DAC_WAVE_T *_pDac)
{
	uint16_t reg_buf[16];
	uint8_t pos = 0;

	reg_buf[pos++] = 1;   /* 固定电压量程，-10V ~ +10V  */
	reg_buf[pos++] = _pDac->Type;	/* DAC波形类型 */
	reg_buf[pos++] = _pDac->VoltMin;  /* 波形最小电压，mV */
	reg_buf[pos++] = _pDac->VoltMax;  /* 波形最大电压，mV */
	reg_buf[pos++] = _pDac->Freq >> 16;       /* 32bit  波形频率，Hz */
	reg_buf[pos++] = _pDac->Freq & 0xFFFF;    /* 32bit  波形频率，Hz */
	reg_buf[pos++] = _pDac->Duty; 	/* 波形占空比 百分比 */
	reg_buf[pos++] = _pDac->CycleSetting >> 16;  /* 32bit  波形个数设置 高16bit */
	reg_buf[pos++] = _pDac->CycleSetting & 0xFFFF;  /* 32bit  波形个数设置 低16bit */
	reg_buf[pos++] = _pDac->Run;

	udp_Send10H(REG03_DAC_WAVE_VOLT_RANGE, pos, reg_buf);
}

/*
*********************************************************************************************************
*	函 数 名: dac1_SetVolt
*	功能说明: 设置DAC输出电压
*	形    参:  无
*	返 回 值: 无
*********************************************************************************************************
*/
void dac1_SetVolt(int _value)
{
	udp_Send06H(REG03_OUT_VOLT_MV, _value);
}

/*
*********************************************************************************************************
*	函 数 名: dac1_SetCurr
*	功能说明: 设置DAC输出电流
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void dac1_SetCurr(int _value)
{
	udp_Send06H(REG03_OUT_CURR_UA, _value);
}

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
