/*
*********************************************************************************************************
*
*	模块名称 : BMP文件处理模块
*	文件名称 : bmp_file.h
*	版    本 : V1.0
*	说    明 : 头文件
*
*	Copyright (C), 2013-2014, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/

#ifndef __BMP_FILE_H
#define __BMP_FILE_H

#include "bsp.h"

uint32_t SaveScreenToBmp(uint32_t _Height, uint32_t _Width, uint8_t *_pRGB565, uint8_t *_pBMP);

#endif

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
